DaQi0510/DDS_Ven2/STM32F407_E_P/HARDWARE/TFT_LCD/TFT_LCD.c
#include "TFT_LCD.h"
#include "delay.h"
#include "stm32f4xx_fsmc.h"
#include "Logo.h"
_lcd_dev lcddev;
u16 POINT_COLOR=0x0842;	//画笔颜色
u16 BACK_COLOR=0xFFFF;  //背景色 

void TFT_LCD_WR_REG(vu16 regval)
{
  u8 i;	
	regval=regval;		   //使用-O2优化的时候,必须插入的延时
	LCD->LCD_REG=regval;//写入要写的寄存器序号	 
}
//写LCD数据
//data:要写入的值
void TFT_LCD_WR_DATA(vu16 data)
{	 
	u8 i;	
	data=data;	
	LCD->LCD_RAM=data;		 
}
//读LCD数据
//返回值:读到的值
u16 TFT_LCD_RD_DATA(void)
{
	vu16 ram;			//防止被优化
	ram=LCD->LCD_RAM;	
	return ram;	 
}					   
//写寄存器
//LCD_Reg:寄存器地址
//LCD_RegValue:要写入的数据
void TFT_LCD_WriteReg(u16 LCD_Reg,u16 LCD_RegValue)
{	
	LCD->LCD_REG = LCD_Reg;		  //写入要写的寄存器序号	 
	LCD->LCD_RAM = LCD_RegValue;//写入数据	    		 
}	   
//读寄存器
//LCD_Reg:寄存器地址
//返回值:读到的数据
u16 TFT_LCD_ReadReg(u16 LCD_Reg)
{	
  u8 i;	
	TFT_LCD_WR_REG(LCD_Reg);		//写入要读的寄存器序号	
  delay_us(5);
	return TFT_LCD_RD_DATA();		//返回读到的值
}   
//开始写GRAM
void TFT_LCD_WriteRAM_Prepare(void)
{
 	LCD->LCD_REG=lcddev.wramcmd;	  
}	 
//LCD写GRAM
//RGB_Code:颜色值
void TFT_LCD_WriteRAM(u16 RGB_Code)
{							    
	LCD->LCD_RAM = RGB_Code;//写十六位GRAM
}


//TFT_LCD开启显示
void TFT_LCD_DisplayOn(void)
{					   
	TFT_LCD_WR_REG(0X2900);	//开启显示
}	 
//TFT_LCD关闭显示
void TFT_LCD_DisplayOff(void)
{	   
	TFT_LCD_WR_REG(0X2800);	//关闭显示
}   
//设置光标位置
//Xpos:横坐标
//Ypos:纵坐标
void TFT_LCD_SetCursor(u16 Xpos, u16 Ypos)
{	 

	TFT_LCD_WR_REG(lcddev.setxcmd);TFT_LCD_WR_DATA(Xpos>>8); 		
	TFT_LCD_WR_REG(lcddev.setxcmd+1);TFT_LCD_WR_DATA(Xpos&0XFF);			 
	TFT_LCD_WR_REG(lcddev.setycmd);TFT_LCD_WR_DATA(Ypos>>8);  		
	TFT_LCD_WR_REG(lcddev.setycmd+1);TFT_LCD_WR_DATA(Ypos&0XFF);			
	
} 		 
//设置LCD的自动扫描方向
//注意:其他函数可能会受到此函数设置的影响(尤其是9341/6804这两个奇葩),
//所以,一般设置为L2R_U2D即可,如果设置为其他扫描方式,可能导致显示不正常.
//dir:0~7,代表8个方向(具体定义见lcd.h)
//9320/9325/9328/4531/4535/1505/b505/5408/9341/5310/5510/1963等IC已经实际测试	   	   
void TFT_LCD_Scan_Dir(u8 dir)
{
	u16 regval=0;
	u16 dirreg=0;
	u16 temp;  
	if(lcddev.dir==1)//横屏时，对6804和1963不改变扫描方向！竖屏时1963改变方向
	{			   
		switch(dir)//方向转换
		{
			case 0:dir=6;break;
			case 1:dir=7;break;
			case 2:dir=4;break;
			case 3:dir=5;break;
			case 4:dir=1;break;
			case 5:dir=0;break;
			case 6:dir=3;break;
			case 7:dir=2;break;	     
		}
	} 
	switch(dir)
	{
		case L2R_U2D://从左到右,从上到下
			regval|=(0<<7)|(0<<6)|(0<<5); 
			break;
		case L2R_D2U://从左到右,从下到上
			regval|=(1<<7)|(0<<6)|(0<<5); 
			break;
		case R2L_U2D://从右到左,从上到下
			regval|=(0<<7)|(1<<6)|(0<<5); 
			break;
		case R2L_D2U://从右到左,从下到上
			regval|=(1<<7)|(1<<6)|(0<<5); 
			break;	 
		case U2D_L2R://从上到下,从左到右
			regval|=(0<<7)|(0<<6)|(1<<5); 
			break;
		case U2D_R2L://从上到下,从右到左
			regval|=(0<<7)|(1<<6)|(1<<5); 
			break;
		case D2U_L2R://从下到上,从左到右
			regval|=(1<<7)|(0<<6)|(1<<5); 
			break;
		case D2U_R2L://从下到上,从右到左
			regval|=(1<<7)|(1<<6)|(1<<5); 
			break;	 
	}
	dirreg=0X3600;
	regval|=(0<<7)|(0<<6)|(1<<5); 
	TFT_LCD_WriteReg(dirreg,regval);
		
	TFT_LCD_WR_REG(lcddev.setxcmd);TFT_LCD_WR_DATA(0); 
	TFT_LCD_WR_REG(lcddev.setxcmd+1);TFT_LCD_WR_DATA(0); 
	TFT_LCD_WR_REG(lcddev.setxcmd+2);TFT_LCD_WR_DATA((lcddev.width-1)>>8); 
	TFT_LCD_WR_REG(lcddev.setxcmd+3);TFT_LCD_WR_DATA((lcddev.width-1)&0XFF); 
	TFT_LCD_WR_REG(lcddev.setycmd);TFT_LCD_WR_DATA(0); 
	TFT_LCD_WR_REG(lcddev.setycmd+1);TFT_LCD_WR_DATA(0); 
	TFT_LCD_WR_REG(lcddev.setycmd+2);TFT_LCD_WR_DATA((lcddev.height-1)>>8); 
	TFT_LCD_WR_REG(lcddev.setycmd+3);TFT_LCD_WR_DATA((lcddev.height-1)&0XFF);
		
}     
//画点
//x,y:坐标
//POINT_COLOR:此点的颜色
void TFT_LCD_DrawPoint(u16 x,u16 y)
{
	TFT_LCD_SetCursor(x,y);		//设置光标位置 
	TFT_LCD_WriteRAM_Prepare();	//开始写入GRAM
	LCD->LCD_RAM=POINT_COLOR; 
}
//快速画点
//x,y:坐标
//color:颜色
void TFT_LCD_Fast_DrawPoint(u16 x,u16 y,u16 color)
{	 
  u8 i;  
	TFT_LCD_SetCursor(x,y);		//设置光标位置 
	TFT_LCD_WriteRAM_Prepare();	//开始写入GRAM
	LCD->LCD_RAM=color;
  for(i=0;i<30;i++)	;
	
//	TFT_LCD_WR_REG(lcddev.setxcmd);TFT_LCD_WR_DATA(x>>8);  
//	TFT_LCD_WR_REG(lcddev.setxcmd+1);TFT_LCD_WR_DATA(x&0XFF);	  
//	TFT_LCD_WR_REG(lcddev.setycmd);TFT_LCD_WR_DATA(y>>8);  
//	TFT_LCD_WR_REG(lcddev.setycmd+1);TFT_LCD_WR_DATA(y&0XFF); 
//	LCD->LCD_REG=lcddev.wramcmd; 
//	LCD->LCD_RAM=color; 
}	 
//SSD1963 背光设置
//pwm:背光等级,0~100.越大越亮.
void TFT_LCD_SSD_BackLightSet(u8 pwm)
{	
	TFT_LCD_WR_REG(0xBE);	//配置PWM输出
	TFT_LCD_WR_DATA(0x05);	//1设置PWM频率
	TFT_LCD_WR_DATA(pwm*2.55);//2设置PWM占空比
	TFT_LCD_WR_DATA(0x01);	//3设置C
	TFT_LCD_WR_DATA(0xFF);	//4设置D
	TFT_LCD_WR_DATA(0x00);	//5设置E
	TFT_LCD_WR_DATA(0x00);	//6设置F
}

//设置LCD显示方向
//dir:0,竖屏；1,横屏
void TFT_LCD_Display_Dir(u8 dir)
{
	if(dir==0)			//竖屏
	{
		lcddev.dir=0;	//竖屏
		lcddev.wramcmd=0X2C00;
		lcddev.setxcmd=0X2A00;
		lcddev.setycmd=0X2B00; 
		lcddev.width=480;
		lcddev.height=800;
	}
	else 				//横屏
	{	  				
		lcddev.dir=1;	//横屏
		lcddev.wramcmd=0X2C00;
		lcddev.setxcmd=0X2A00;
		lcddev.setycmd=0X2B00; 
		lcddev.width=800;
		lcddev.height=480;
	} 
	TFT_LCD_Scan_Dir(DFT_SCAN_DIR);	//默认扫描方向
}	 
//设置窗口,并自动设置画点坐标到窗口左上角(sx,sy).
//sx,sy:窗口起始坐标(左上角)
//width,height:窗口宽度和高度,必须大于0!!
//窗体大小:width*height. 
void TFT_LCD_Set_Window(u16 sx,u16 sy,u16 width,u16 height)
{    
	u8 hsareg,heareg,vsareg,veareg;
	u16 hsaval,heaval,vsaval,veaval; 
	u16 twidth,theight;
	twidth=sx+width-1;
	theight=sy+height-1;
	TFT_LCD_WR_REG(lcddev.setxcmd);TFT_LCD_WR_DATA(sx>>8);  
	TFT_LCD_WR_REG(lcddev.setxcmd+1);TFT_LCD_WR_DATA(sx&0XFF);	  
	TFT_LCD_WR_REG(lcddev.setxcmd+2);TFT_LCD_WR_DATA(twidth>>8);   
	TFT_LCD_WR_REG(lcddev.setxcmd+3);TFT_LCD_WR_DATA(twidth&0XFF);   
	TFT_LCD_WR_REG(lcddev.setycmd);TFT_LCD_WR_DATA(sy>>8);   
	TFT_LCD_WR_REG(lcddev.setycmd+1);TFT_LCD_WR_DATA(sy&0XFF);  
	TFT_LCD_WR_REG(lcddev.setycmd+2);TFT_LCD_WR_DATA(theight>>8);   
	TFT_LCD_WR_REG(lcddev.setycmd+3);TFT_LCD_WR_DATA(theight&0XFF);  
	
}
//初始化lcd
//该初始化函数可以初始化各种ILI93XX液晶,但是其他函数是基于ILI9320的!!!
//在其他型号的驱动芯片上没有测试! 
void TFT_LCD_Init(void)
{ 	
	vu32 i=0;
	
  GPIO_InitTypeDef  GPIO_InitStructure;
	FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;
  FSMC_NORSRAMTimingInitTypeDef  readWriteTiming; 
	FSMC_NORSRAMTimingInitTypeDef  writeTiming;
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC|RCC_AHB1Periph_GPIOB|RCC_AHB1Periph_GPIOD|RCC_AHB1Periph_GPIOE|RCC_AHB1Periph_GPIOF|RCC_AHB1Periph_GPIOG, ENABLE);//使能PD,PE,PF,PG时钟  
  RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC,ENABLE);//使能FSMC时钟  
	
 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;//PB15 推挽输出,控制背光
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;//普通输出模式
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//100MHz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
  GPIO_Init(GPIOC, &GPIO_InitStructure);//初始化 //PB15 推挽输出,控制背光
	
