DaQi0510/DDS_Ven2/STM32F407_E_P/HARDWARE/TFT_LCD/TFT_LCD.c
  GPIO_InitStructure.GPIO_Pin = (3<<0)|(3<<4)|(7<<8)|(3<<14);//PD0,1,4,5,8,9,10,14,15 AF OUT
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//复用输出
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
  GPIO_Init(GPIOD, &GPIO_InitStructure);//初始化  
	
  GPIO_InitStructure.GPIO_Pin = (0X1FF<<7);//PE7~15,AF OUT
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//复用输出
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
  GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化  

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;//PF12,FSMC_A6
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//复用输出
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
  GPIO_Init(GPIOF, &GPIO_InitStructure);//初始化  

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;//PF12,FSMC_A6
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//复用输出
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100MHz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
  GPIO_Init(GPIOG, &GPIO_InitStructure);//初始化 

  GPIO_PinAFConfig(GPIOD,GPIO_PinSource0,GPIO_AF_FSMC);//PD0,AF12
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource1,GPIO_AF_FSMC);//PD1,AF12
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource4,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource5,GPIO_AF_FSMC); 
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource8,GPIO_AF_FSMC); 
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource9,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource10,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource14,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD,GPIO_PinSource15,GPIO_AF_FSMC);//PD15,AF12
 
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource7,GPIO_AF_FSMC);//PE7,AF12
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource8,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource9,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource10,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource11,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource12,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource13,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource14,GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE,GPIO_PinSource15,GPIO_AF_FSMC);//PE15,AF12
 
  GPIO_PinAFConfig(GPIOF,GPIO_PinSource12,GPIO_AF_FSMC);//PF12,AF12
  GPIO_PinAFConfig(GPIOG,GPIO_PinSource12,GPIO_AF_FSMC);


  readWriteTiming.FSMC_AddressSetupTime = 0X0F;	 //地址建立时间（ADDSET）为16个HCLK 1/168M=6ns*16=96ns	
  readWriteTiming.FSMC_AddressHoldTime = 0x00;	 //地址保持时间（ADDHLD）模式A未用到	
  readWriteTiming.FSMC_DataSetupTime = 60;			//数据保存时间为60个HCLK	=6*60=360ns
  readWriteTiming.FSMC_BusTurnAroundDuration = 0x00;
  readWriteTiming.FSMC_CLKDivision = 0x00;
  readWriteTiming.FSMC_DataLatency = 0x00;
  readWriteTiming.FSMC_AccessMode = FSMC_AccessMode_A;	 //模式A 
    

	writeTiming.FSMC_AddressSetupTime =12;	      //地址建立时间（ADDSET）为12个HCLK =54ns 
  writeTiming.FSMC_AddressHoldTime = 0x00;	 //地址保持时间（A		
  writeTiming.FSMC_DataSetupTime =14;		 //数据保存时间为6ns*9个HCLK=54ns
  writeTiming.FSMC_BusTurnAroundDuration = 0x00;
  writeTiming.FSMC_CLKDivision = 0x00;
  writeTiming.FSMC_DataLatency = 0x00;
  writeTiming.FSMC_AccessMode = FSMC_AccessMode_A;	 //模式A 

 
  FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM4;//  这里我们使用NE4 ，也就对应BTCR[6],[7]。
  FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable; // 不复用数据地址
  FSMC_NORSRAMInitStructure.FSMC_MemoryType =FSMC_MemoryType_SRAM;// FSMC_MemoryType_SRAM;  //SRAM   
  FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;//存储器数据宽度为16bit   
  FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode =FSMC_BurstAccessMode_Disable;// FSMC_BurstAccessMode_Disable; 
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
	FSMC_NORSRAMInitStructure.FSMC_AsynchronousWait=FSMC_AsynchronousWait_Disable; 
  FSMC_NORSRAMInitStructure.FSMC_WrapMode = FSMC_WrapMode_Disable;   
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;  
  FSMC_NORSRAMInitStructure.FSMC_WriteOperation = FSMC_WriteOperation_Enable;	//  存储器写使能
  FSMC_NORSRAMInitStructure.FSMC_WaitSignal = FSMC_WaitSignal_Disable;   
  FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = FSMC_ExtendedMode_Enable; // 读写使用不同的时序
  FSMC_NORSRAMInitStructure.FSMC_WriteBurst = FSMC_WriteBurst_Disable; 
  FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &readWriteTiming; //读写时序
  FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &writeTiming;  //写时序

  FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure);  //初始化FSMC配置

  FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM4, ENABLE);  // 使能BANK1 
		
 	delay_ms(50); // delay 50 ms 
 	TFT_LCD_WriteReg(0x0000,0x0001);
	delay_ms(50); // delay 50 ms 
  lcddev.id = TFT_LCD_ReadReg(0x0000);   
  if(lcddev.id<0XFF||lcddev.id==0XFFFF||lcddev.id==0X9300)//读到ID不正确,新增lcddev.id==0X9300判断，因为9341在未被复位的情况下会被读成9300
	{	
 		//尝试9341 ID的读取		
		TFT_LCD_WR_REG(0XD3);				   
		lcddev.id=TFT_LCD_RD_DATA();	//dummy read 	
 		lcddev.id=TFT_LCD_RD_DATA();	//读到0X00
  	lcddev.id=TFT_LCD_RD_DATA();   	//读取93								   
 		lcddev.id<<=8;
		lcddev.id|=TFT_LCD_RD_DATA();  	//读取41 	   			   
 		
	} 
	
		//重新配置写时序控制寄存器的时序   	 							    
		FSMC_Bank1E->BWTR[6]&=~(0XF<<0); //地址建立时间(ADDSET)清零 	 
		FSMC_Bank1E->BWTR[6]&=~(0XF<<8); //数据保存时间清零
		FSMC_Bank1E->BWTR[6]|=2<<0;		   //地址建立时间(ADDSET)为3个HCLK =18ns  	 
		FSMC_Bank1E->BWTR[6]|=3<<8; 	   //数据保存时间(DATAST)为6ns*3个HCLK=18ns
		TFT_LCD_WriteReg(0xF000,0x55);
		TFT_LCD_WriteReg(0xF001,0xAA);
		TFT_LCD_WriteReg(0xF002,0x52);
		TFT_LCD_WriteReg(0xF003,0x08);
		TFT_LCD_WriteReg(0xF004,0x01);
		//AVDD Set AVDD 5.2V
		TFT_LCD_WriteReg(0xB000,0x0D);
		TFT_LCD_WriteReg(0xB001,0x0D);
		TFT_LCD_WriteReg(0xB002,0x0D);
		//AVDD ratio
		TFT_LCD_WriteReg(0xB600,0x34);
		TFT_LCD_WriteReg(0xB601,0x34);
		TFT_LCD_WriteReg(0xB602,0x34);
		//AVEE -5.2V
		TFT_LCD_WriteReg(0xB100,0x0D);
		TFT_LCD_WriteReg(0xB101,0x0D);
		TFT_LCD_WriteReg(0xB102,0x0D);
		//AVEE ratio
		TFT_LCD_WriteReg(0xB700,0x34);
		TFT_LCD_WriteReg(0xB701,0x34);
		TFT_LCD_WriteReg(0xB702,0x34);
		//VCL -2.5V
		TFT_LCD_WriteReg(0xB200,0x00);
		TFT_LCD_WriteReg(0xB201,0x00);
		TFT_LCD_WriteReg(0xB202,0x00);
		//VCL ratio
		TFT_LCD_WriteReg(0xB800,0x24);
		TFT_LCD_WriteReg(0xB801,0x24);
		TFT_LCD_WriteReg(0xB802,0x24);
		//VGH 15V (Free pump)
		TFT_LCD_WriteReg(0xBF00,0x01);
		TFT_LCD_WriteReg(0xB300,0x0F);
		TFT_LCD_WriteReg(0xB301,0x0F);
		TFT_LCD_WriteReg(0xB302,0x0F);
		//VGH ratio
		TFT_LCD_WriteReg(0xB900,0x34);
		TFT_LCD_WriteReg(0xB901,0x34);
		TFT_LCD_WriteReg(0xB902,0x34);
		//VGL_REG -10V
		TFT_LCD_WriteReg(0xB500,0x08);
		TFT_LCD_WriteReg(0xB501,0x08);
		TFT_LCD_WriteReg(0xB502,0x08);
		TFT_LCD_WriteReg(0xC200,0x03);
		//VGLX ratio
		TFT_LCD_WriteReg(0xBA00,0x24);
		TFT_LCD_WriteReg(0xBA01,0x24);
		TFT_LCD_WriteReg(0xBA02,0x24);
		//VGMP/VGSP 4.5V/0V
		TFT_LCD_WriteReg(0xBC00,0x00);
		TFT_LCD_WriteReg(0xBC01,0x78);
		TFT_LCD_WriteReg(0xBC02,0x00);
		//VGMN/VGSN -4.5V/0V
		TFT_LCD_WriteReg(0xBD00,0x00);
		TFT_LCD_WriteReg(0xBD01,0x78);
		TFT_LCD_WriteReg(0xBD02,0x00);
		//VCOM
		TFT_LCD_WriteReg(0xBE00,0x00);
		TFT_LCD_WriteReg(0xBE01,0x64);
		//Gamma Setting
		TFT_LCD_WriteReg(0xD100,0x00);
		TFT_LCD_WriteReg(0xD101,0x33);
		TFT_LCD_WriteReg(0xD102,0x00);
		TFT_LCD_WriteReg(0xD103,0x34);
		TFT_LCD_WriteReg(0xD104,0x00);
		TFT_LCD_WriteReg(0xD105,0x3A);
		TFT_LCD_WriteReg(0xD106,0x00);
		TFT_LCD_WriteReg(0xD107,0x4A);
		TFT_LCD_WriteReg(0xD108,0x00);
		TFT_LCD_WriteReg(0xD109,0x5C);
		TFT_LCD_WriteReg(0xD10A,0x00);
		TFT_LCD_WriteReg(0xD10B,0x81);
		TFT_LCD_WriteReg(0xD10C,0x00);
		TFT_LCD_WriteReg(0xD10D,0xA6);
		TFT_LCD_WriteReg(0xD10E,0x00);
		TFT_LCD_WriteReg(0xD10F,0xE5);
		TFT_LCD_WriteReg(0xD110,0x01);
		TFT_LCD_WriteReg(0xD111,0x13);
		TFT_LCD_WriteReg(0xD112,0x01);
		TFT_LCD_WriteReg(0xD113,0x54);
		TFT_LCD_WriteReg(0xD114,0x01);
		TFT_LCD_WriteReg(0xD115,0x82);
		TFT_LCD_WriteReg(0xD116,0x01);
		TFT_LCD_WriteReg(0xD117,0xCA);
		TFT_LCD_WriteReg(0xD118,0x02);
		TFT_LCD_WriteReg(0xD119,0x00);
		TFT_LCD_WriteReg(0xD11A,0x02);
		TFT_LCD_WriteReg(0xD11B,0x01);
		TFT_LCD_WriteReg(0xD11C,0x02);
		TFT_LCD_WriteReg(0xD11D,0x34);
		TFT_LCD_WriteReg(0xD11E,0x02);
		TFT_LCD_WriteReg(0xD11F,0x67);
		TFT_LCD_WriteReg(0xD120,0x02);
		TFT_LCD_WriteReg(0xD121,0x84);
		TFT_LCD_WriteReg(0xD122,0x02);
		TFT_LCD_WriteReg(0xD123,0xA4);
		TFT_LCD_WriteReg(0xD124,0x02);
		TFT_LCD_WriteReg(0xD125,0xB7);
		TFT_LCD_WriteReg(0xD126,0x02);
		TFT_LCD_WriteReg(0xD127,0xCF);
		TFT_LCD_WriteReg(0xD128,0x02);
		TFT_LCD_WriteReg(0xD129,0xDE);
		TFT_LCD_WriteReg(0xD12A,0x02);
		TFT_LCD_WriteReg(0xD12B,0xF2);
		TFT_LCD_WriteReg(0xD12C,0x02);
		TFT_LCD_WriteReg(0xD12D,0xFE);
		TFT_LCD_WriteReg(0xD12E,0x03);
		TFT_LCD_WriteReg(0xD12F,0x10);
		TFT_LCD_WriteReg(0xD130,0x03);
		TFT_LCD_WriteReg(0xD131,0x33);
		TFT_LCD_WriteReg(0xD132,0x03);
		TFT_LCD_WriteReg(0xD133,0x6D);
		TFT_LCD_WriteReg(0xD200,0x00);
		TFT_LCD_WriteReg(0xD201,0x33);
		TFT_LCD_WriteReg(0xD202,0x00);
		TFT_LCD_WriteReg(0xD203,0x34);
		TFT_LCD_WriteReg(0xD204,0x00);
		TFT_LCD_WriteReg(0xD205,0x3A);
		TFT_LCD_WriteReg(0xD206,0x00);
		TFT_LCD_WriteReg(0xD207,0x4A);
		TFT_LCD_WriteReg(0xD208,0x00);
		TFT_LCD_WriteReg(0xD209,0x5C);
		TFT_LCD_WriteReg(0xD20A,0x00);

		TFT_LCD_WriteReg(0xD20B,0x81);
		TFT_LCD_WriteReg(0xD20C,0x00);
		TFT_LCD_WriteReg(0xD20D,0xA6);
		TFT_LCD_WriteReg(0xD20E,0x00);
		TFT_LCD_WriteReg(0xD20F,0xE5);
		TFT_LCD_WriteReg(0xD210,0x01);
		TFT_LCD_WriteReg(0xD211,0x13);
		TFT_LCD_WriteReg(0xD212,0x01);
		TFT_LCD_WriteReg(0xD213,0x54);
		TFT_LCD_WriteReg(0xD214,0x01);
		TFT_LCD_WriteReg(0xD215,0x82);
		TFT_LCD_WriteReg(0xD216,0x01);
		TFT_LCD_WriteReg(0xD217,0xCA);
		TFT_LCD_WriteReg(0xD218,0x02);
		TFT_LCD_WriteReg(0xD219,0x00);
		TFT_LCD_WriteReg(0xD21A,0x02);
		TFT_LCD_WriteReg(0xD21B,0x01);
		TFT_LCD_WriteReg(0xD21C,0x02);
		TFT_LCD_WriteReg(0xD21D,0x34);
		TFT_LCD_WriteReg(0xD21E,0x02);
		TFT_LCD_WriteReg(0xD21F,0x67);
		TFT_LCD_WriteReg(0xD220,0x02);
		TFT_LCD_WriteReg(0xD221,0x84);
		TFT_LCD_WriteReg(0xD222,0x02);
		TFT_LCD_WriteReg(0xD223,0xA4);
		TFT_LCD_WriteReg(0xD224,0x02);
		TFT_LCD_WriteReg(0xD225,0xB7);
		TFT_LCD_WriteReg(0xD226,0x02);
		TFT_LCD_WriteReg(0xD227,0xCF);
		TFT_LCD_WriteReg(0xD228,0x02);
		TFT_LCD_WriteReg(0xD229,0xDE);
		TFT_LCD_WriteReg(0xD22A,0x02);
		TFT_LCD_WriteReg(0xD22B,0xF2);
		TFT_LCD_WriteReg(0xD22C,0x02);
		TFT_LCD_WriteReg(0xD22D,0xFE);
		TFT_LCD_WriteReg(0xD22E,0x03);
		TFT_LCD_WriteReg(0xD22F,0x10);
		TFT_LCD_WriteReg(0xD230,0x03);
		TFT_LCD_WriteReg(0xD231,0x33);
		TFT_LCD_WriteReg(0xD232,0x03);
		TFT_LCD_WriteReg(0xD233,0x6D);
		TFT_LCD_WriteReg(0xD300,0x00);
		TFT_LCD_WriteReg(0xD301,0x33);
		TFT_LCD_WriteReg(0xD302,0x00);
		TFT_LCD_WriteReg(0xD303,0x34);
		TFT_LCD_WriteReg(0xD304,0x00);
		TFT_LCD_WriteReg(0xD305,0x3A);
		TFT_LCD_WriteReg(0xD306,0x00);
		TFT_LCD_WriteReg(0xD307,0x4A);
		TFT_LCD_WriteReg(0xD308,0x00);
		TFT_LCD_WriteReg(0xD309,0x5C);
		TFT_LCD_WriteReg(0xD30A,0x00);

		TFT_LCD_WriteReg(0xD30B,0x81);
		TFT_LCD_WriteReg(0xD30C,0x00);
		TFT_LCD_WriteReg(0xD30D,0xA6);
		TFT_LCD_WriteReg(0xD30E,0x00);
		TFT_LCD_WriteReg(0xD30F,0xE5);
		TFT_LCD_WriteReg(0xD310,0x01);
		TFT_LCD_WriteReg(0xD311,0x13);
		TFT_LCD_WriteReg(0xD312,0x01);
		TFT_LCD_WriteReg(0xD313,0x54);
		TFT_LCD_WriteReg(0xD314,0x01);
		TFT_LCD_WriteReg(0xD315,0x82);
		TFT_LCD_WriteReg(0xD316,0x01);
		TFT_LCD_WriteReg(0xD317,0xCA);
		TFT_LCD_WriteReg(0xD318,0x02);
		TFT_LCD_WriteReg(0xD319,0x00);
		TFT_LCD_WriteReg(0xD31A,0x02);
		TFT_LCD_WriteReg(0xD31B,0x01);
		TFT_LCD_WriteReg(0xD31C,0x02);
		TFT_LCD_WriteReg(0xD31D,0x34);
		TFT_LCD_WriteReg(0xD31E,0x02);
		TFT_LCD_WriteReg(0xD31F,0x67);
		TFT_LCD_WriteReg(0xD320,0x02);
		TFT_LCD_WriteReg(0xD321,0x84);
		TFT_LCD_WriteReg(0xD322,0x02);
		TFT_LCD_WriteReg(0xD323,0xA4);
		TFT_LCD_WriteReg(0xD324,0x02);
		TFT_LCD_WriteReg(0xD325,0xB7);
		TFT_LCD_WriteReg(0xD326,0x02);
		TFT_LCD_WriteReg(0xD327,0xCF);
		TFT_LCD_WriteReg(0xD328,0x02);
		TFT_LCD_WriteReg(0xD329,0xDE);
		TFT_LCD_WriteReg(0xD32A,0x02);
		TFT_LCD_WriteReg(0xD32B,0xF2);
		TFT_LCD_WriteReg(0xD32C,0x02);
		TFT_LCD_WriteReg(0xD32D,0xFE);
		TFT_LCD_WriteReg(0xD32E,0x03);
		TFT_LCD_WriteReg(0xD32F,0x10);
		TFT_LCD_WriteReg(0xD330,0x03);
		TFT_LCD_WriteReg(0xD331,0x33);
		TFT_LCD_WriteReg(0xD332,0x03);
		TFT_LCD_WriteReg(0xD333,0x6D);
		TFT_LCD_WriteReg(0xD400,0x00);
		TFT_LCD_WriteReg(0xD401,0x33);
		TFT_LCD_WriteReg(0xD402,0x00);
		TFT_LCD_WriteReg(0xD403,0x34);
		TFT_LCD_WriteReg(0xD404,0x00);
		TFT_LCD_WriteReg(0xD405,0x3A);
		TFT_LCD_WriteReg(0xD406,0x00);
		TFT_LCD_WriteReg(0xD407,0x4A);
		TFT_LCD_WriteReg(0xD408,0x00);
		TFT_LCD_WriteReg(0xD409,0x5C);
		TFT_LCD_WriteReg(0xD40A,0x00);
		TFT_LCD_WriteReg(0xD40B,0x81);

		TFT_LCD_WriteReg(0xD40C,0x00);
		TFT_LCD_WriteReg(0xD40D,0xA6);
		TFT_LCD_WriteReg(0xD40E,0x00);
		TFT_LCD_WriteReg(0xD40F,0xE5);
		TFT_LCD_WriteReg(0xD410,0x01);
		TFT_LCD_WriteReg(0xD411,0x13);
		TFT_LCD_WriteReg(0xD412,0x01);
		TFT_LCD_WriteReg(0xD413,0x54);
		TFT_LCD_WriteReg(0xD414,0x01);
		TFT_LCD_WriteReg(0xD415,0x82);
		TFT_LCD_WriteReg(0xD416,0x01);
		TFT_LCD_WriteReg(0xD417,0xCA);
		TFT_LCD_WriteReg(0xD418,0x02);
		TFT_LCD_WriteReg(0xD419,0x00);
		TFT_LCD_WriteReg(0xD41A,0x02);
		TFT_LCD_WriteReg(0xD41B,0x01);
		TFT_LCD_WriteReg(0xD41C,0x02);
		TFT_LCD_WriteReg(0xD41D,0x34);
		TFT_LCD_WriteReg(0xD41E,0x02);
		TFT_LCD_WriteReg(0xD41F,0x67);
		TFT_LCD_WriteReg(0xD420,0x02);
		TFT_LCD_WriteReg(0xD421,0x84);
		TFT_LCD_WriteReg(0xD422,0x02);
		TFT_LCD_WriteReg(0xD423,0xA4);
		TFT_LCD_WriteReg(0xD424,0x02);
		TFT_LCD_WriteReg(0xD425,0xB7);
		TFT_LCD_WriteReg(0xD426,0x02);
		TFT_LCD_WriteReg(0xD427,0xCF);
		TFT_LCD_WriteReg(0xD428,0x02);
		TFT_LCD_WriteReg(0xD429,0xDE);
		TFT_LCD_WriteReg(0xD42A,0x02);
		TFT_LCD_WriteReg(0xD42B,0xF2);
		TFT_LCD_WriteReg(0xD42C,0x02);
		TFT_LCD_WriteReg(0xD42D,0xFE);
		TFT_LCD_WriteReg(0xD42E,0x03);
		TFT_LCD_WriteReg(0xD42F,0x10);
		TFT_LCD_WriteReg(0xD430,0x03);
		TFT_LCD_WriteReg(0xD431,0x33);
		TFT_LCD_WriteReg(0xD432,0x03);
		TFT_LCD_WriteReg(0xD433,0x6D);
		TFT_LCD_WriteReg(0xD500,0x00);
		TFT_LCD_WriteReg(0xD501,0x33);
		TFT_LCD_WriteReg(0xD502,0x00);
		TFT_LCD_WriteReg(0xD503,0x34);
		TFT_LCD_WriteReg(0xD504,0x00);
		TFT_LCD_WriteReg(0xD505,0x3A);
		TFT_LCD_WriteReg(0xD506,0x00);
		TFT_LCD_WriteReg(0xD507,0x4A);
		TFT_LCD_WriteReg(0xD508,0x00);
		TFT_LCD_WriteReg(0xD509,0x5C);
		TFT_LCD_WriteReg(0xD50A,0x00);
		TFT_LCD_WriteReg(0xD50B,0x81);

