DaQi0510/DDS_Ven2/STM32F407_E_P/HARDWARE/TFT_LCD/TFT_LCD.c
		TFT_LCD_WriteReg(0xD50C,0x00);
		TFT_LCD_WriteReg(0xD50D,0xA6);
		TFT_LCD_WriteReg(0xD50E,0x00);
		TFT_LCD_WriteReg(0xD50F,0xE5);
		TFT_LCD_WriteReg(0xD510,0x01);
		TFT_LCD_WriteReg(0xD511,0x13);
		TFT_LCD_WriteReg(0xD512,0x01);
		TFT_LCD_WriteReg(0xD513,0x54);
		TFT_LCD_WriteReg(0xD514,0x01);
		TFT_LCD_WriteReg(0xD515,0x82);
		TFT_LCD_WriteReg(0xD516,0x01);
		TFT_LCD_WriteReg(0xD517,0xCA);
		TFT_LCD_WriteReg(0xD518,0x02);
		TFT_LCD_WriteReg(0xD519,0x00);
		TFT_LCD_WriteReg(0xD51A,0x02);
		TFT_LCD_WriteReg(0xD51B,0x01);
		TFT_LCD_WriteReg(0xD51C,0x02);
		TFT_LCD_WriteReg(0xD51D,0x34);
		TFT_LCD_WriteReg(0xD51E,0x02);
		TFT_LCD_WriteReg(0xD51F,0x67);
		TFT_LCD_WriteReg(0xD520,0x02);
		TFT_LCD_WriteReg(0xD521,0x84);
		TFT_LCD_WriteReg(0xD522,0x02);
		TFT_LCD_WriteReg(0xD523,0xA4);
		TFT_LCD_WriteReg(0xD524,0x02);
		TFT_LCD_WriteReg(0xD525,0xB7);
		TFT_LCD_WriteReg(0xD526,0x02);
		TFT_LCD_WriteReg(0xD527,0xCF);
		TFT_LCD_WriteReg(0xD528,0x02);
		TFT_LCD_WriteReg(0xD529,0xDE);
		TFT_LCD_WriteReg(0xD52A,0x02);
		TFT_LCD_WriteReg(0xD52B,0xF2);
		TFT_LCD_WriteReg(0xD52C,0x02);
		TFT_LCD_WriteReg(0xD52D,0xFE);
		TFT_LCD_WriteReg(0xD52E,0x03);
		TFT_LCD_WriteReg(0xD52F,0x10);
		TFT_LCD_WriteReg(0xD530,0x03);
		TFT_LCD_WriteReg(0xD531,0x33);
		TFT_LCD_WriteReg(0xD532,0x03);
		TFT_LCD_WriteReg(0xD533,0x6D);
		TFT_LCD_WriteReg(0xD600,0x00);
		TFT_LCD_WriteReg(0xD601,0x33);
		TFT_LCD_WriteReg(0xD602,0x00);
		TFT_LCD_WriteReg(0xD603,0x34);
		TFT_LCD_WriteReg(0xD604,0x00);
		TFT_LCD_WriteReg(0xD605,0x3A);
		TFT_LCD_WriteReg(0xD606,0x00);
		TFT_LCD_WriteReg(0xD607,0x4A);
		TFT_LCD_WriteReg(0xD608,0x00);
		TFT_LCD_WriteReg(0xD609,0x5C);
		TFT_LCD_WriteReg(0xD60A,0x00);
		TFT_LCD_WriteReg(0xD60B,0x81);

		TFT_LCD_WriteReg(0xD60C,0x00);
		TFT_LCD_WriteReg(0xD60D,0xA6);
		TFT_LCD_WriteReg(0xD60E,0x00);
		TFT_LCD_WriteReg(0xD60F,0xE5);
		TFT_LCD_WriteReg(0xD610,0x01);
		TFT_LCD_WriteReg(0xD611,0x13);
		TFT_LCD_WriteReg(0xD612,0x01);
		TFT_LCD_WriteReg(0xD613,0x54);
		TFT_LCD_WriteReg(0xD614,0x01);
		TFT_LCD_WriteReg(0xD615,0x82);
		TFT_LCD_WriteReg(0xD616,0x01);
		TFT_LCD_WriteReg(0xD617,0xCA);
		TFT_LCD_WriteReg(0xD618,0x02);
		TFT_LCD_WriteReg(0xD619,0x00);
		TFT_LCD_WriteReg(0xD61A,0x02);
		TFT_LCD_WriteReg(0xD61B,0x01);
		TFT_LCD_WriteReg(0xD61C,0x02);
		TFT_LCD_WriteReg(0xD61D,0x34);
		TFT_LCD_WriteReg(0xD61E,0x02);
		TFT_LCD_WriteReg(0xD61F,0x67);
		TFT_LCD_WriteReg(0xD620,0x02);
		TFT_LCD_WriteReg(0xD621,0x84);
		TFT_LCD_WriteReg(0xD622,0x02);
		TFT_LCD_WriteReg(0xD623,0xA4);
		TFT_LCD_WriteReg(0xD624,0x02);
		TFT_LCD_WriteReg(0xD625,0xB7);
		TFT_LCD_WriteReg(0xD626,0x02);
		TFT_LCD_WriteReg(0xD627,0xCF);
		TFT_LCD_WriteReg(0xD628,0x02);
		TFT_LCD_WriteReg(0xD629,0xDE);
		TFT_LCD_WriteReg(0xD62A,0x02);
		TFT_LCD_WriteReg(0xD62B,0xF2);
		TFT_LCD_WriteReg(0xD62C,0x02);
		TFT_LCD_WriteReg(0xD62D,0xFE);
		TFT_LCD_WriteReg(0xD62E,0x03);
		TFT_LCD_WriteReg(0xD62F,0x10);
		TFT_LCD_WriteReg(0xD630,0x03);
		TFT_LCD_WriteReg(0xD631,0x33);
		TFT_LCD_WriteReg(0xD632,0x03);
		TFT_LCD_WriteReg(0xD633,0x6D);
		//LV2 Page 0 enable
		TFT_LCD_WriteReg(0xF000,0x55);
		TFT_LCD_WriteReg(0xF001,0xAA);
		TFT_LCD_WriteReg(0xF002,0x52);
		TFT_LCD_WriteReg(0xF003,0x08);
		TFT_LCD_WriteReg(0xF004,0x00);
		//Display control
		TFT_LCD_WriteReg(0xB100, 0xCC);
		TFT_LCD_WriteReg(0xB101, 0x00);
		//Source hold time
		TFT_LCD_WriteReg(0xB600,0x05);
		//Gate EQ control
		TFT_LCD_WriteReg(0xB700,0x70);
		TFT_LCD_WriteReg(0xB701,0x70);
		//Source EQ control (Mode 2)
		TFT_LCD_WriteReg(0xB800,0x01);
		TFT_LCD_WriteReg(0xB801,0x03);
		TFT_LCD_WriteReg(0xB802,0x03);
		TFT_LCD_WriteReg(0xB803,0x03);
		//Inversion mode (2-dot)
		TFT_LCD_WriteReg(0xBC00,0x02);
		TFT_LCD_WriteReg(0xBC01,0x00);
		TFT_LCD_WriteReg(0xBC02,0x00);
		//Timing control 4H w/ 4-delay
		TFT_LCD_WriteReg(0xC900,0xD0);
		TFT_LCD_WriteReg(0xC901,0x02);
		TFT_LCD_WriteReg(0xC902,0x50);
		TFT_LCD_WriteReg(0xC903,0x50);
		TFT_LCD_WriteReg(0xC904,0x50);
		TFT_LCD_WriteReg(0x3500,0x00);
		TFT_LCD_WriteReg(0x3A00,0x55);  //16-bit/pixel
		TFT_LCD_WR_REG(0x1100);
		delay_us(120);
		TFT_LCD_WR_REG(0x2900);
	
	TFT_LCD_Display_Dir(1);		//默认为竖屏
	TFT_LCD_LED=1;				//点亮背光
	delay_ms(50);
	TFT_LCD_Clear(BACK_COLOR);
}  
//清屏函数
//color:要清屏的填充色
void TFT_LCD_Clear(u16 color)
{
	u32 index=0;      
	u32 totalpoint=lcddev.width;
	totalpoint*=lcddev.height ; 			//得到总点数
	TFT_LCD_SetCursor(0x00,0x0000);	//设置光标位置 
	TFT_LCD_WriteRAM_Prepare();     		//开始写入GRAM	 	  
	for(index=0;index<totalpoint;index++)
	{
		LCD->LCD_RAM=color;	
	}
}
void TFT_LCD_ShowLogo(void)
{
	u16 x=123;
	u16 y=25,j;
	u16 Colors;
  volatile u16 Color[554];
	u8 i;
	u32 index=0;
	for(i=0;i<82;i++)
	{
		for(j=0;j<554;j++)
		{
			index=1108*i+2*j;
			Color[j]=(gImage_LOGO[index+1]<<8)+gImage_LOGO[index];
//			Color[j]=RED;
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<554;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowLASER(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[90];
	u8 i;
	u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<90;j++)
		{
			index=180*i+2*j;
			Color[j]=(gImage_LASER[index+1]<<8)+gImage_LASER[index];
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<90;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowPOWER(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[95];
	u8 i;
	u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<95;j++)
		{
			index=190*i+2*j;
			Color[j]=(gImage_POWER[index+1]<<8)+gImage_POWER[index];
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<95;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowPULSE(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[90];
	u8 i;
	u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<90;j++)
		{
			index=180*i+2*j;
			Color[j]=(gImage_PULSE[index+1]<<8)+gImage_PULSE[index];
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<90;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowRED(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[60];
	u8 i;
	u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<60;j++)
		{
			index=120*i+2*j;
			Color[j]=(gImage_RED[index+1]<<8)+gImage_RED[index];
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<60;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowMODE(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[90];
	u8 i;
	u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<90;j++)
		{
			index=180*i+2*j;
			Color[j]=(gImage_MODE[index+1]<<8)+gImage_MODE[index];
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<90;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowWIDTH(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[95];
	u8 i;
	u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<95;j++)
		{
			index=190*i+2*j;
			Color[j]=(gImage_WIDTH[index+1]<<8)+gImage_WIDTH[index];
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<95;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}

void TFT_LCD_ShowON(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[90];
	u8 i;
	u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<45;j++)
		{
			index=90*i+2*j;
			Color[j]=(gImage_ON[index+1]<<8)+gImage_ON[index];
		}
		for(j=45;j<90;j++)
		{
			Color[j]=BACK_COLOR;
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<90;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowOFF(u16 x,u16 y)
{
	u16 j;
  volatile u16 Color[90];
	u8 i;
	volatile u32 index=0;
	for(i=0;i<30;i++)
	{
		for(j=0;j<54;j++)
		{
			index=108*i+2*j;
			Color[j]=(gImage_OFF[index+1]<<8)+gImage_OFF[index];
		}
		for(j=54;j<90;j++)
		{
			Color[j]=BACK_COLOR;
		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<90;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
	}
}
void TFT_LCD_ShowChar(u16 x,u16 y,u8 *InfNum,u8 Num)
{
	u16 j,s=0;
  volatile u16 Color[140];
	u8 i,k;
	volatile u32 index=0;
	for(i=0;i<30;i++)
	{
		for(k=0;k<Num;k++)
		{
			if(InfNum[k]<=9)
			{
				for(j=0;j<14;j++)
				{
					index=280*i+InfNum[k]*28+2*j;
					Color[s]=(gImage_Char[index+1]<<8)+gImage_Char[index];
					s++;
				}
			}
			if(InfNum[k]==10)
			{
				for(j=0;j<9;j++)
				{
					index=8400+18*i+2*j;
					Color[s]=(gImage_Char[index+1]<<8)+gImage_Char[index];
					s++;
				}
			}
			if(InfNum[k]==11)
			{
				for(j=0;j<25;j++)
				{
					index=8940+50*i+2*j;
					Color[s]=(gImage_Char[index+1]<<8)+gImage_Char[index];
					s++;
				}
			}
			
