DaQi0510/DDS_Ven2/STM32F407_E_P/HARDWARE/TFT_LCD/TFT_LCD.c
		}
		for(j=s;j<140;j++)
		{
			Color[j]=BACK_COLOR;
		}
//		while(s<140)
//		{
//			Color[s]=BACK_COLOR;
//		}
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_SetCursor(x,y+i);
		TFT_LCD_WriteRAM_Prepare(); 
		for(j=0;j<140;j++)
		{
			LCD->LCD_RAM=Color[j];	
		}
		s=0;
	}
}

void ShowLine(void)
{
	u8 i;
	u16 index;
	for(i=0;i<8;i++)
	{
		TFT_LCD_SetCursor(40,127+i);	//设置光标位置 
		TFT_LCD_WriteRAM_Prepare();
		for(index=0;index<720;index++)
		{
			LCD->LCD_RAM=POINT_COLOR;	
		} 
	}
	
}
void TFT_LCD_ShowADNum(u8 Value)
{
  u8 i;
	u16 Num;
	u8 InfNum[8];
	u16 AddressX=500,AddressY=159;
	Num=Value*200/51;
	InfNum[0]=12;
	if(Num<100)
	{
		i=Num/10;
		InfNum[1]=i;
		InfNum[2]=10;
		i=Num%10;
		InfNum[3]=i;
		InfNum[4]=11;
		InfNum[5]=12;
		InfNum[6]=12;
	}
	if(Num<1000&&Num>99)
	{
		i=Num/100;
		InfNum[1]=i;
		i=(Num%100)/10;
		InfNum[2]=i;
		InfNum[3]=10;
		i=Num%10;
		InfNum[4]=i;
		InfNum[5]=11;
		InfNum[6]=12;
	}
	if(Num==1000)
	{
		i=Num/1000;
		InfNum[1]=i;
		InfNum[2]=0;
		InfNum[3]=0;
		InfNum[4]=10;
		InfNum[5]=0;
		InfNum[6]=11;
	}
	 TFT_LCD_ShowChar(AddressX,AddressY,InfNum,7);
	 
	
}
void TFT_LCD_ShowPulseValue(u16 Value)
{
	u8 i;
	u16 Num;
	u8 InfNum[4];
	u16 AddressX=500,AddressY=214;
	Num=Value*200/51;
	InfNum[0]=12;
	if(Value<100)
	{
		i=Value/10;
		InfNum[1]=i;
		i=Value%10;
		InfNum[2]=i;
		InfNum[3]=12;
	}
	else
	{
		i=Value/100;
		InfNum[1]=i;
		i=(Value%100)/10;
		InfNum[2]=i;
		i=Value%10;
		InfNum[3]=i;
	}
	TFT_LCD_ShowChar(AddressX,AddressY,InfNum,4);
}
void TFT_LCD_ShowRedValue(u8 Value)
{
	if(Value==1)
	{
		TFT_LCD_ShowON(500,267);
	}
	else
	{
		TFT_LCD_ShowOFF(500,267);
	}
}
void TFT_LCD_ShowLaserValue(u8 Value)
{
	u16 AddressX=500,AddressY=248;
	if(Value==1)
	{
		TFT_LCD_ShowON(500,322);
	}
	else
	{
		TFT_LCD_ShowOFF(500,322);
	}
}
void TFT_LCD_ShowModeValue(u8 Value)
{
	u8 InfNum[8];
	u16 AddressX=500,AddressY=377;
	if(Value==1)
	{
		InfNum[0]=2;
	}
	else
	{
		InfNum[0]=1;
	}
	TFT_LCD_ShowChar(AddressX,AddressY,InfNum,1);
}
void TFT_LCD_ShowWidthValue(u16 Value)
{
	u8 i;
	u16 Num;
	u8 InfNum[8];
	u16 AddressX=500,AddressY=432;
	Num=Value*200/51;
	if(Value<100&&Value!=0)
	{
		i=Value/10;
		InfNum[0]=i;
		i=Value%10;
		InfNum[1]=i;
		InfNum[2]=12;
	}
	
	if(Value>=100)
	{
		i=Value/100;
		InfNum[0]=i;
		i=(Value%100)/10;
		InfNum[1]=i;
		i=Value%10;
		InfNum[2]=i;
	}
	if(Value==0)
	{
		InfNum[0]=0;
		InfNum[1]=12;
		InfNum[2]=12;
	}
	TFT_LCD_ShowChar(AddressX,AddressY,InfNum,3);
}



